# NameList

## Description
Function NameList returns the specified object name from the object name list.

```pascal
FUNCTION NameList(index : LONGINT) : STRING;
```

```python

def vs.NameList(index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|LONGINT|Name list position index (in a arange of 1 - n).|

## Version
Availability: from MiniCAD
## Category
* Object Names